calm water resistance/KVLCC2/Fr0.1515/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     blockMeshDict;
}

scale 1;

vertices
(
	(-11.07676888719776 0 -7.094624700477905)
	(16.615153330796637 0 -7.094624700477905)
	(16.615153330796637 8.01006014570086 -7.094624700477905)
	(-11.07676888719776 8.01006014570086 -7.094624700477905)
	(-11.07676888719776 0 2.975165196974605)
	(16.615153330796637 0 2.975165196974605)
	(16.615153330796637 8.01006014570086 2.975165196974605)
	(-11.07676888719776 8.01006014570086 2.975165196974605)
);

edges
(

);

blocks
(
	hex (0 1 2 3 4 5 6 7) (121 35 44) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
		);
	}
	sides
	{
		type patch;
		faces
		(
			(3 2 6 7)
			(0 3 2 1)
		);
	}
	midPlane
	{
		type symmetryPlane;
		faces
		(
			(0 1 5 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
);

