calm water resistance/KVLCC2/Fr0.1515/0.org/include/initialConditions
flowVelocity          (1.114568 0 0);
Umean                  1.114568;
turbulentKE            1.863392e-04;
turbulentOmega         1.010085e+00;
turbulentEpsilon       1.129310e-07;
turbulentNut           3.420000e-06;
transitionTu           1.000000e+00;
transitionLambdaTheta  0.000000e+00;
transitionFLambdaTheta 1.000000e+00;
transitionReThetat     5.843016e+02;
#inputMode       merge;